{"id":1364,"date":"2024-03-24T05:35:51","date_gmt":"2024-03-24T05:35:51","guid":{"rendered":"https:\/\/demo.wprealizer.com\/powerai\/a-journey-into-the-heart-of-innovation-copy-copy-copy-copy-copy-copy-copy-copy\/"},"modified":"2024-03-25T09:38:22","modified_gmt":"2024-03-25T09:38:22","slug":"if-art-is-how-we-express-our-humanity-where-does-ai-fit","status":"publish","type":"post","link":"https:\/\/demo.wprealizer.com\/powerai\/if-art-is-how-we-express-our-humanity-where-does-ai-fit\/","title":{"rendered":"AI Revolutionizing Industries and Reshaping Tomorrow"},"content":{"rendered":"\n<p>Computational models that mimic the structure and function of the human auditory system could help researchers design better hearing aids, cochlear implants, and brain-machine interfaces. A new study from MIT has found that modern computational models derived from machine learning are moving closer to this goal.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Models of hearing<\/h2>\n\n\n\n<p>Deep neural networks are computational models that consists of many layers of information-processing units that can be trained on huge volumes of data to perform specific tasks. This type of model has become widely used in many applications, and neuroscientists have begun to explore the possibility that these systems can also be used to describe how the human brain performs certain tasks.<\/p>\n\n\n\n<p>When a neural network is performing a task, its processing units generate activation patterns in response to each audio input it receives. Those model representations of the input can be compared to the activation patterns seen in fMRI brain scans of people listening to the same input.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Hierarchical processing<\/h2>\n\n\n\n<p>The new study also supports the idea that the human auditory cortex has some degree of hierarchical organization, in which processing is divided into stages that support distinct computational functions. As in the 2018 study, the researchers found that representations generated in earlier stages of the model most closely resemble those seen in the primary auditory cortex, while representations generated in later model stages more closely resemble those generated in brain regions beyond the primary cortex.<\/p>\n\n\n\n<p>Additionally, the researchers found that models that had been trained on different tasks were better at replicating different aspects of audition. For example, models trained on a speech-related task more closely resembled speech-selective areas.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>“The study suggests that models that are derived from machine learning are a step in the right direction, and it gives us some clues as to what tends to make them better models of the brain.”<\/p>\n<cite>Brendon Peterson<\/cite><\/blockquote>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion of Deep neural networks show promise as models of human hearing<\/h2>\n\n\n\n<p>The research was funded by the National Institutes of Health, an Amazon Fellowship from the Science Hub, an International Doctoral Fellowship from the American Association of University Women, an MIT Friends of McGovern Institute Fellowship, a fellowship from the K. Lisa Yang Integrative Computational Neuroscience (ICoN) Center at MIT, and a Department of Energy Computational Science Graduate Fellowship.<\/p>\n\n\n\n<p>A goal of our field is to end up with a computer model that can predict brain responses and behavior. We think that if we are successful in reaching that goal, it will open a lot of doors.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The rapid advance of artificial intelligence has generated a lot of buzz, with some predicting it&#8230;<\/p>\n","protected":false},"author":1,"featured_media":1673,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[8,9,6,7],"_links":{"self":[{"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/posts\/1364"}],"collection":[{"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/comments?post=1364"}],"version-history":[{"count":0,"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/posts\/1364\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/media\/1673"}],"wp:attachment":[{"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/media?parent=1364"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/categories?post=1364"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/demo.wprealizer.com\/powerai\/wp-json\/wp\/v2\/tags?post=1364"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}